<?php
  require_once "../php/default.php";
  require_once "../php/db_connect.php";
  require_once "../php/functions.php";
  session_start();
?>

<!DOCTYPE html>
<html lang="ja">

<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1">
  <meta name="description" content="">
  <meta property="og:url" content="https://acaoly-inofficial.com/terms_of_service.php">
  <meta property="og:type" content="website">
  <meta property="og:site_name" content="学術オリンピック非公式まとめサイト">
  <meta property="og:image" content="https://acaoly-inofficial.com/img/comp_site_thumbnail.png">
  <meta property="og:title" content="利用規約">
  <meta name="twitter:card" content="summary">
  <meta name="twitter:site" content="@acaoly_notifi">
  <link rel="shortcut icon" type="image/x-icon" href="/img/favicon.ico">
  <link rel="preconnect" href="https://fonts.googleapis.com">
  <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
  <link href="https://fonts.googleapis.com/css2?family=Noto+Sans+JP:wght@100..900&family=Roboto+Condensed:wght@500&display=swap" rel="stylesheet">
  <title>利用規約 | 学術オリンピック非公式まとめサイト</title>
  <link rel="stylesheet" href="/css/common.css">
  <link rel="stylesheet" href="/css/colors.css">
  <link rel="stylesheet" href="/css/editorial.css">
  <link rel="stylesheet" href="/css/schedule.css">
  <link rel="stylesheet" href="/css/past.css">
</head>

<body>
  <?php echo default_header(); ?>

  <h2 class="h2">Terms of Service</h2>

  <div class="basic-container">
    <div class="basic-container-inner">
      <h3>利用規約</h3>
      <p>この利用規約（以下、「本規約」といいます。）は、Fernweh（以下、「運営者」といいます。）がこのウェブサイト上で提供するサービス（以下、「本サービス」といいます。）の利用条件を定めるものです。アカウント登録を行ったユーザーの皆様（以下、「ユーザー」といいます。）には、本規約に従って、本サービスをご利用いただきます。なお、アカウント登録を行わなくとも、本サービスの大半の機能を利用することができます。詳細はユーザーガイドをご覧ください。</p>

      <h4>第1条（適用）</h4>
      <ol>
        <li>本規約は、ユーザーと運営者との間の本サービスの利用に関わる一切の関係に適用されるものとします。</li>
        <li>運営者は本サービスに関し、本規約のほか、ご利用にあたっての規則、ルール、ガイドライン等、各種の定め（以下、「個別規定」といいます。）をすることがあります。これら個別規定はその名称の如何に関わらず、本規約の一部を構成するものとします。</li>
        <li>本規約の規定が前条の個別規定の規定と矛盾する場合には、個別規定において特段の定めのない限り、個別規定の規定が本規約よりも優先されるものとします。</li>
      </ol>

      <h4>第2条（利用登録）</h4>
      <p>本サービスにおいては、登録希望者が本規約および別掲のプライバシーポリシーに同意の上、運営者の定める方法によって利用登録を行うことで、利用登録が完了するものとします。</p>

      <h4>第3条（パスワードの管理）</h4>
      <ol>
        <li>ユーザーは、自己の責任において、本サービスのパスワードを適切に管理するものとします。</li>
        <li>ユーザーは、いかなる場合にも、パスワードを第三者に譲渡または貸与し、もしくはアカウントを第三者と共用することはできません。また、運営者は、ユーザー名とパスワードの組み合わせが登録されている情報と一致してログインされた場合には、そのユーザー名を登録しているユーザー自身による利用とみなします。</li>
        <li>ユーザーのパスワードが第三者によって使用されたことにより生じた損害は、本サービスの運営上に大きな支障がある場合を除いて、運営者はこのことに関し一切の責任を負わないものとします。</li>
      </ol>

      <h4>第4条（利用料金）</h4>
      <p>本サービスの、法律によって定められた範囲内での利用に対して料金が請求されることはありません。</p>

      <h4>第5条（禁止事項）</h4>
      <ol>
        <li>ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。
          <ol>
            <li>法令または公序良俗に違反する行為</li>
            <li>犯罪行為に関連する行為</li>
            <li>本サービス上でほかのユーザーが持つ著作権、商標権ほか知的財産権を侵害する行為</li>
            <li>運営者、ほかのユーザー、またはその他第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為</li>
            <li>本サービスが提供する情報を、情報の出典元の許可なく商業的に利用する行為</li>
            <li>本サービスの運営を妨害するおそれのある行為</li>
            <li>不正アクセスをし、またはこれを試みる行為</li>
            <li>他のユーザーに関する個人情報を収集または蓄積する行為</li>
            <li>不正な目的を持って本サービスを利用する行為</li>
            <li>本サービスのほかのユーザーまたはその他の第三者に不利益、損害、不快感を与える行為</li>
            <li>ほかのユーザーや第三者になりすます行為</li>
            <li>本サービス上での宣伝、広告、勧誘、または営業行為</li>
            <li>面識のない異性との出会いを目的とした行為</li>
            <li>本サービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為</li>
            <li>その他、運営者が不適切と判断する行為</li>
          </ol>
        </li>
        <li>前項の各号の行為を行った場合、第7条1項の通り対処します。</li>
      </ol>

      <h4>第6条（本サービスの提供の停止等）</h4>
      <ol>
        <li>運営者は、以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
          <ul>
            <li>本サービスにかかるコンピュータシステムまたは本サービス自体の保守点検または更新を行う場合</li>
            <li>地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合</li>
            <li>コンピュータや通信回線等が事故により停止した場合</li>
            <li>情報収集元の各団体や個人から、本サービスの全部または一部に関する情報の掲載停止を求められるなど、継続して全部または一部の情報を提供することが困難であると判断した場合</li>
            <li>その他、運営者が本サービスを提供することが困難であると判断した場合</li>
          </ul>
        </li>
        <li>運営者は、前項各号の事由による本サービスの提供の停止または中断により、ユーザーまたは第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。</li>
      </ol>

      <h4>第7条（利用制限および登録抹消）</h4>
      <ol>
        <li>運営者は、ユーザーが本規約の条項のいずれかに違反する、または運営者が本サービスの運営上不適切であると判断した場合、事前の通知なく、ユーザーに対して、本サービスの全部または一部の停止、またはユーザーとしての登録を抹消することができます。</li>
        <li>運営者は、前項に基づき運営者が行った行為によりユーザーに生じた損害について、一切の責任を負いません。</li>
      </ol>

      <h4>第8条（退会）</h4>
      <p>ユーザーは、運営者の定める退会手続により、本サービスから退会できるものとします。</p>

      <h4>第9条（保証の否認および免責事項）</h4>
      <ol>
        <li>運営者は、本サービスに事実上または法律上の瑕疵（情報やその他の安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。</li>
        <li>運営者は、本サービスに起因してユーザーに生じたあらゆる損害について、運営者の故意又は重過失による場合を除き、一切の責任を負いません。ただし、本サービスに関する運営者とユーザーとの間の契約（本規約を含みます。）が日本の消費者契約法に定める消費者契約となる場合、この免責規定は適用されません。</li>
        <li>前項ただし書に定める場合であっても、運営者は、運営者の過失（重過失を除きます。）による不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（当社またはユーザーが損害発生につき予見し、または予見し得た場合を含みます。）について一切の責任を負いません。</li>
        <li>運営者は、本サービスに関して、ユーザーと他のユーザーまたは第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。</li>
      </ol>

      <h4>第10条（サービス内容の変更等）</h4>
      <ol>
        <li>運営者は、以下に該当する場合を除き、ユーザーへの事前または直後の告知をもって、本サービスの内容を変更、追加または廃止することがあり、ユーザーはこれを承諾するものとします。また、以下の内容に該当する場合であっても、運営者は本サービス上でユーザーや第三者に、本サービスの内容を変更、追加または廃止することを告知、または本サービスの内容を変更、追加または廃止したことを通知することがあります。
          <ul>
            <li>本サービスがユーザーおよび第三者に提供する情報（各分野に関する情報、各大会の開催に関する情報、各大会の過去問、統計情報、ユーザー解説等）の追加または些細な修正を行う場合</li>
            <li>本サービスの些細な不具合の修正を行う場合</li>
            <li>その他特段にユーザーへの通知を行う必要がないと判断するような些細な変更等を行う場合</li>
          </ul>
        </li>
        <li>前項の内容のうち、特に本サービスの内容の廃止に関しては、運営者は、やむを得ない場合を除き、ユーザーへの事前の告知を必ず行うものとします。</li>
      </ol>

      <h4>第11条（利用規約およびこれに準ずる規約の変更）</h4>
      <ol>
        <li>運営者は以下の場合には、ユーザーの個別の同意を要せず、本規約および本規約に準ずる規約の内容の全部または一部を変更することができるものとします。
          <ul>
            <li>本規約および本規約に準ずる規約の変更がユーザーの一般の利益に適合するとき。</li>
            <li>本規約および本規約に準ずる規約の変更が本サービス利用契約の目的に反せず、かつ、変更の必要性、変更後の内容の相当性その他の変更に係る事情に照らして合理的なものであるとき。</li>
          </ul>
        </li>
        <li>運営者はユーザーに対し、前項による本規約および本規約に準ずる規約の変更にあたり、事前に、本規約および本規約に準ずる規約を変更する旨および変更後の本規約およびおよび本規約に準ずる規約の内容並びにその効力の発生する時期を通知するものとします。</li>
      </ol>

      <h4>第12条（個人情報の取り扱い）</h4>
      <p>運営者は、本サービスの利用によって取得する個人情報については、プライバシーポリシーに従い適切に取り扱うものとします。</p>

      <h4>第13条（通知または連絡）</h4>
      <ol>
        <li>ユーザーと運営者との間の通知または連絡は、運営者の定める方法によって行うものとします。運営者は、ユーザーから運営者が別途定める方式に従った変更届け出がない限り、現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い、これらは、発信時にユーザーへ到達したものとみなします。</li>
        <li>ユーザーが本サービスに連絡先を登録していない、または有効でない連絡先を登録していた場合に、運営者からの通知または連絡を受け取ることができなかったために生じた不利益または損害について、運営者は一切の責任を負いません。</li>
      </ol>

      <h4>第14条（権利義務の譲渡の禁止）</h4>
      <p>ユーザーは、運営者の書面またはその他信頼に足る媒体による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。</p>

      <h4>第15条（準拠法）</h4>
      <p>本規約の解釈にあたっては、日本法を準拠法とします。</p>

      <h5>附則</h5>

      <h4>第1条（本規約の適用）</h4>
      <p>本規約は2024年9月9日から適用されるものとします。</p>
    </div>
  </div>

  <?php echo default_footer(); ?>
</body>

</html>